app/views/good_orders/index.html.haml

          %td{data: {label: GoodOrder.human_attribute_name(:order)} }
            = good_order.order.order_number
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "good_orders".* FROM "good_orders"