app/views/orders/index.html.haml

SELECT "orders".* FROM "orders"
---
  %li
    = link_to t('activerecord.models.order'), orders_path