app/views/orders/search.html.haml

              = label_tag(Good.human_attribute_name(:article))
              = select_tag "search_good_article", options_for_select(Good.all.map{|p| p.article}, ), include_blank: true, class: 'form-control', value: params["search_good_article"].nil? ? nil : params["search_good_article"]
          .col-md-6
            .form-group
---
SELECT "goods"."id" FROM "goods" WHERE (article = '2')