app/views/orders/show.html.haml

SELECT "good_orders".* FROM "good_orders" WHERE "good_orders"."order_id" = $1  [["order_id", 6]]
---
  %li
    = link_to t('activerecord.models.order'), orders_path