app/controllers/good_orders_controller.rb

  def index
    @good_orders = GoodOrder.all
---
SELECT "good_orders".* FROM "good_orders"

    def set_good_order
      @good_order = GoodOrder.find(params[:id])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT 1  [["id", 2]]