app/controllers/goods_controller.rb

SELECT "goods".* FROM "goods"
---
  def index
    @goods = Good.all