app/controllers/orders_controller.rb

  def create
    @order = Order.new(order_params)

    if Order.count == 0
      @number_of_order = 1
    else
      @number_of_order = Order.last.order_number + 1
    end

    @order.order_number = @number_of_order
    tn = Time.now
    @order.order_date = Date.new(tn.year, tn.month, tn.day)

    arr = []
    @order.good_orders.each do |l|
---
SELECT COUNT(*) FROM "orders"
SELECT  "orders".* FROM "orders"  ORDER BY "orders"."id" DESC LIMIT 1
SELECT "goods".* FROM "goods"

	@order.total_cost = cost + extra_cost

    respond_to do |format|
      status = @order.save
---
INSERT INTO "good_orders" ("good_id", "digit", "order_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["good_id", 3], ["digit", 2], ["order_id", 6], ["created_at", "2017-06-17 17:29:09.963935"], ["updated_at", "2017-06-17 17:29:09.963935"]]
INSERT INTO "orders" ("payment_method", "delivery_method", "list_products", "cost_goods", "total_cost", "client_id", "order_number", "order_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

      end
      if flag and status
        @order.good_orders.each do |l|
          p = Good.where(id: l.good_id).first
          p.quantity_in_stock -= l.digit
          p.save
---
SELECT  "goods".* FROM "goods" WHERE "goods"."id" = $1  ORDER BY "goods"."id" ASC LIMIT 1  [["id", 1]]
UPDATE "goods" SET "quantity_in_stock" = $1, "updated_at" = $2 WHERE "goods"."id" = $3  [["quantity_in_stock", 117], ["updated_at", "2017-06-18 15:32:07.427891"], ["id", 1]]

  def update
    arr = []
    hash = order_params
    hash["good_orders_attributes"].each do |p|
      if p[1]["_destroy"] == "1"
        arr << p[1]["id"].to_i
        hash["good_orders_attributes"].delete(p[0])
      end
    end
    arr.each do |id|
      l = GoodOrder.where("id = ?", id).first
      l.good.quantity_in_stock += l.digit
      l.good.save
      l.destroy
    end

    tn = Time.now
    @order.order_date = Date.new(tn.year, tn.month, tn.day)

    arr = []
    @order.good_orders.each do |l|
      arr << l.good.title
---
DELETE FROM "good_orders" WHERE "good_orders"."id" = $1  [["id", 7]]
SELECT  "good_orders".* FROM "good_orders" WHERE (id = 7)  ORDER BY "good_orders"."id" ASC LIMIT 1
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT 1  [["id", 6]]
UPDATE "good_orders" SET "good_id" = $1, "updated_at" = $2 WHERE "good_orders"."id" = $3  [["good_id", 3], ["updated_at", "2017-06-18 15:40:06.218614"], ["id", 4]]
UPDATE "goods" SET "quantity_in_stock" = $1, "updated_at" = $2 WHERE "goods"."id" = $3  [["quantity_in_stock", 15], ["updated_at", "2017-06-17 17:29:44.999836"], ["id", 3]]
UPDATE "orders" SET "list_products" = $1, "cost_goods" = $2, "total_cost" = $3, "delivery_method" = $4, "updated_at" = $5 WHERE "orders"."id" = $6  [["list_products", "\n 1) Футболка \n"], ["cost_goods", 3300.0], ["total_cost", 3300.0], ["delivery_method", "Курьером"], ["updated_at", "2017-06-17 17:29:35.297421"], ["id", 6]]
INSERT INTO "good_orders" ("good_id", "digit", "order_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["good_id", 3], ["digit", 12], ["order_id", 6], ["created_at", "2017-06-17 17:29:35.301282"], ["updated_at", "2017-06-17 17:29:35.301282"]]

  def destroy
    @order.destroy
---
DELETE FROM "good_orders" WHERE "good_orders"."id" = $1  [["id", 8]]
DELETE FROM "orders" WHERE "orders"."id" = $1  [["id", 7]]

    def set_order
      @order = Order.find(params[:id])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT 1  [["id", 7]]
SELECT "good_orders".* FROM "good_orders" WHERE "good_orders"."order_id" = $1  [["order_id", 7]]