app/controllers/users_controller.rb

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "role_users" SET "data" = $1, "updated_at" = $2 WHERE "role_users"."id" = $3  [["data", "{\"data\":\"\"}"], ["updated_at", "2017-06-18 18:09:28.415543"], ["id", 2]]
UPDATE "users" SET "last_activity_at" = '2017-06-18 18:09:28.449644' WHERE "users"."id" = $1  [["id", 1]]

    def set_user
      @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "role_users".* FROM "role_users" WHERE "role_users"."user_id" = $1 AND "role_users"."id" = 2  [["user_id", 2]]